from data_structure.PriorityQueue import ProblemBook, PriorityQueue
from tk_interface import TkinterInterface


# Задание 1.
# Создайте приложение используя очереди с приоритетом.
# Представим что нужно спроектировать список задач. У каждой задачи
# есть приоритет, это значит, что вначале должны быть самые приоритетные
# задачи. Сами задачи можно обрабатывать только по одной, мы не можем взять
# задачу с центра списка.
# При старте приложения отображается меню:
# a. Добавить новую задачу
# b. Выполнить текущую задачу
# c. Изменить приоритет задачи


def execute_application():
    TkinterInterface()


if __name__ == '__main__':
    execute_application()
